# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [5]:
import pandas as pd
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [32]:
random.seed(1)
series1 = pd.Series([random.randint(1,4) for x in range(100) ])
series2 = pd.Series([random.randint(1,3) for x in range(100) ])
series3 = pd.Series([random.randint(10000,30000) for x in range(100) ])

print(series1)

0     2
1     1
2     3
3     1
4     4
     ..
95    1
96    3
97    4
98    1
99    2
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [35]:
#pd.DataFrame([series1,series2,series3],index=["series1","series2","series3"])
house = pd.concat([series1,series2,series3],axis=1)
house.head()

   0  1      2
0  2  3  14272
1  1  1  10277
2  3  3  28373
3  1  3  11242
4  4  1  29352

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [36]:
house.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
house.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            14272
1      1       1            10277
2      3       3            28373
3      1       3            11242
4      4       1            29352

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [52]:
bigcolumn = pd.concat([series1,series2,series3],axis=0)
bigcolumn = pd.DataFrame(bigcolumn)
bigcolumn

        0
0       2
1       1
2       3
3       1
4       4
..    ...
95  13745
96  25000
97  19082
98  13530
99  11499

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [53]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [54]:
bigcolumn.reset_index(drop = True,inplace =True)
bigcolumn

         0
0        2
1        1
2        3
3        1
4        4
..     ...
295  13745
296  25000
297  19082
298  13530
299  11499

[300 rows x 1 columns]